xml/modifyAuthenticationToUserByToken.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:e="http://www.technisys.net/cmm/services/errors/v1.0" xmlns:md="http://www.technisys.net/cmm/services/metadata/v2.0" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
  <SOAP-ENV:Header>
    <md:metadata>
      <serviceId>modifyAuthenticationToUserByToken</serviceId>
      <serviceVersion>0.0</serviceVersion>
      <sessionId>${sessionId}</sessionId>
      <targetChannel>
        <mnemonic>${channel}</mnemonic>
      </targetChannel>
      <executingChannel>
        <mnemonic>${channel}</mnemonic>
      </executingChannel>
      <address>ip=${ip};</address>
      <featureId>ROL@2002</featureId>
      <locale>en_PA</locale>
      <cmmDispatchDate>${cmmDispatchDate}</cmmDispatchDate>
      <customProperties/>
    </md:metadata>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <srv:modifyAuthenticationToUserByTokenRequest xmlns:srv="http://www.technisys.net/cmm/services/modifyAuthenticationToUserByToken/rq/v0.0">
      <electronicsContact name="electronicsContact">
        <emailAddressComplete>${emailAddressComplete}</emailAddressComplete>
      </electronicsContact>
      <token name="token">
        <value>${token}</value>
      </token>
      <authentication name="newAuthentication">
        <dynamicAuthenticacion>
          <authenticationAnswer>${keyValueNew}</authenticationAnswer>
        </dynamicAuthenticacion>
      </authentication>
      <systemUser name="systemUser">
        <userName>${keyAlias}</userName>
      </systemUser>
      <customer name="customer">
        <identificationType>
          <mnemonic>${identificationType}</mnemonic>
        </identificationType>
        <identificationNumber>${identificationNumber}</identificationNumber>
      </customer>
      <channel name="channel">
        <identificationChannel>
          <mnemonic>${channel}</mnemonic>
        </identificationChannel>
      </channel>
      <channel name="channelOperation">
        <identificationChannel>
          <mnemonic>${channel}</mnemonic>
        </identificationChannel>
      </channel>
    </srv:modifyAuthenticationToUserByTokenRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
